# Level Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ClassificationEntry..::..Level Property
ClassificationEntry Class See Also
---
The entry level in the classification table. The expected range is between 1 and 5 inclusive.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public int Level { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Level As Integer
	Get
```

Visual C++
---
```text
public:
property int Level {
	int get ();
}
```

# See Also
ClassificationEntry Class
Autodesk.Revit.DB Namespace